package org.iris.wiki.config

object CommonConfig {

    val ttf = "data/思源黑体.ttf"

    val equip_attr_path = "data/image/equip"


    val s = "标准射速:\n" +
            "\t初始:12.24s/轮\n" +
            "\t强化+10(满):10.58s/轮\n" +
            "航空:45\n" +
            "大型作战塞壬增伤:强化+11后获得此属性\n" +
            "\t强化+13:3%\n" +
            "挂载武器:\n" +
            "\t1 x MG151 20mm机炮:\n" +
            "\t\t伤害:\n" +
            "\t\t\t初始:10\n" +
            "\t\t\t强化+10:20\n" +
            "\t\t\t强化+13:24\n" +
            "\t\t标准射速:\n" +
            "\t\t\t初始:0.97s/轮\n" +
            "\t\t\t强化+10(满):0.82s/轮\n" +
            "\t\t机枪射程:36\n" +
            "\t\t机枪射角:80\n" +
            "\t2 x 7.92mm MG17机枪:\n" +
            "\t\t伤害:\n" +
            "\t\t\t初始:13\n" +
            "\t\t\t强化+10:24\n" +
            "\t\t\t强化+13:28\n" +
            "\t\t标准射速:\n" +
            "\t\t\t初始:0.4s/轮\n" +
            "\t\t\t强化+10(满):0.3s/轮\n" +
            "\t\t机枪射程:36\n" +
            "\t\t机枪射角:80\n" +
            "\t4 x 穿甲火箭弹:\n" +
            "\t\t伤害:\n" +
            "\t\t\t初始:110\n" +
            "\t\t\t强化+10:160\n" +
            "\t\t\t强化+13:189\n" +
            "\t\t伤害范围:7\n" +
            "\t\t散布范围:12*5\n" +
            "\t\t对甲比例:110-140-50\n" +
            "装备参数:\n" +
            "\t所属阵营:铁血\n" +
            "\t舰载机航速:50\n" +
            "\t舰载机耐久:\n" +
            "\t\t初始:202\n" +
            "\t\t强化+10:504\n" +
            "\t\t强化+13:595\n" +
            "\t舰载机回避上限:10\n" +
            "适用舰种"
}